# SetItemClickable

## Description
Sets the specified item to generate events when clicked.  Currently only static text and images are supported.

```pascal
PROCEDURE SetItemClickable(
				dialogID    : LONGINT;
				componentID : LONGINT;
				clickable   : BOOLEAN);
```

```python

def vs.SetItemClickable(dialogID, componentID, clickable):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|clickable|BOOLEAN||

## Version
Availability: from Vectorworks 2010
## Category
* Dialogs - Modern